def input_num() -> int:
    """
    Функція для зчитування максимального числа індекса рядка Фібоначі
    :return: максимальний індекс
    """
    while True:
        try:
            k = int(input('Ведіть кінцевий індекс: '))
            if k <= 0:
                print("Не можу сгенерувати від'ємну або нульову кількість елементів в рядку Фібоначі")
                continue
            return k
        except Exception:
            print('Трясся, я не можу сприйняти це як кінцевий індекс')


def gen_fibo(end_num: int):
    """
    Функція генератор, яка генерує рядок Фібоначі
    :param end_num: максимальний індекс
    :return: генерує наступне число в рядку Фібоначі
    """
    y = 1
    z = 0
    for i in range(end_num):
        yield z
        x = y
        y = z
        z = x + y


if __name__ == '__main__':
    # інпут від користувача максимального числа індекса рядка Фібоначі
    s = input_num()
    # цикл генерації рядка Фібоначі
    for num in gen_fibo(s):
        print(num)
