# обявляємо змінну як список
x = []
# наповнюємо список
for i in range(100):
    Enter_num = input('Введіть число для обчислення суми чисел чи введіть "sum" для отримання результату\n')
    # Виконується вихід з циклу, якщо було введено sum
    if 'sum' in Enter_num.lower():
        break
    # перевірка, що було введено число
    try:
        float(Enter_num)
        x.append(Enter_num)
    # якщо не число, то повідомляемо про помилку
    except Exception:
        print('Ох, дідько, щось я перестав тебе розуміти, давай знову спробуємо')

# виводимо загальну кількість введених саме чисел в списку
print('Кількість чисел для обчислення становить: ', len(x))

# обявляємо змінну
Sum_num = 0
# сумуємо всі числі зі списку
for i in range(len(x)):
    Sum_num = Sum_num + float(x[i])

# вивід результату
print('Сума становить: ', Sum_num)
