# перевірка на введення
while True:
    Enter_num = input('Введіть необхідні числа для додавання через кому, для обчислення, в кінці введіть "sum" \n')
    if 'sum' in Enter_num.lower():
        break
    else:
        print('Ох, дідько, чомусь "sum" в строчці відсутня')

# об`являємо список
x = []
x = Enter_num.split(',')
# рахуємо кількість елементів списка
y = len(x)
# записуємо останній індекс в змінну
z = str(x[y - 1])

# перевірка на дліну списка
if (y - 1) == 0:
    print('Числа для обчислювання відсутні')
    # перевіряємо чи останній індекс це 'sum'
elif z.lower() != 'sum':
    print('"sum"  введено не в кінці, останнє число не буде обчислено')

# об`являємо змінні
Sum_num = 0
a = 0

# перевіряємо список на тип даних числа та обчислюємо
for i in range(y - 1):
    # перевірка, що було введено число
    try:
        float(x[i])
        Sum_num += float(x[i])
        print(x[i])
        print('Число додано до обчислювання')
        a += 1
    # якщо не число, то повідомляємо про помилку
    except Exception:
        print(x[i], '- це не можу сприйняти як число')

# виводимо загальну кількість введених саме чисел в списку
print('Кількість чисел для обчислення становить: ', a)

# вивід результату
print('Сума становить: ', Sum_num)
