# об`являємо змінну
Sum_num = 0
a = 0
# виконуємо цикл
for i in range(100):
    Enter_num = input('Введіть число для обчислення суми чисел чи введіть "sum" для отримання результату\n')

    # Виконується вихід з циклу, якщо було введено sum
    if 'sum' in Enter_num.lower():
        break

    # перевірка, що було введено число
    try:
        float(Enter_num)
        Sum_num += float(Enter_num)
        a += 1
        print('Число додано до обчислювання')
    # якщо не число, то повідомляємо про помилку
    except Exception:
        print('Ох, дідько, щось я перестав тебе розуміти, давай знову спробуємо')

# виводимо після закінчення обчислювання
print('Ви ввели "sum" або досягли ліміту вводу в 100 разів')
# виводимо загальну кількість введених саме чисел в списку
print('Кількість чисел для обчислення становить: ', a)
# вивід результату
print('Сума становить: ', Sum_num)
